In [1]:
#! pip install ipython-sql 
import sqlite3
import pandas as pd
from sqlalchemy import *
from gradedb import Gradedb
from schema import *

In [2]:
%load_ext sql
%sql sqlite:///gradedb.db

In [3]:
%%sql
SELECT *
  FROM Assignment

 * sqlite:///gradedb.db
Done.

[(1, 'S0416410', 1),
 (2, 'S0225853', 2),
 (3, 'S1961057', 3),
 (4, 'S2204697', 4),
 (5, 'S4587398', 5)]

In [4]:
%%sql
SELECT *
  FROM Student

 * sqlite:///gradedb.db
Done.

[('S0416410', 'Marjorie Steele', 's0416410@vuw.leidenuniv.nl'),
 ('S0225853', 'James Morse', 's0225853@vuw.leidenuniv.nl'),
 ('S1961057', 'Dominic Robinson', 's1961057@vuw.leidenuniv.nl'),
 ('S2204697', 'Diana Brown', 's2204697@vuw.leidenuniv.nl'),
 ('S4587398', 'Mary Bakley', 's4587398@vuw.leidenuniv.nl')]

In [5]:
%%sql
SELECT *
  FROM Question

 * sqlite:///gradedb.db
Done.

[(1, 'Question 1', "Over ahorseback thrall-like Dwight Dowlin's shooi?"),
 (2, 'Question 2', 'Calculate epigee None QID molimen physic-nut?'),
 (3, 'Question 3', 'Calculate Pandanaceae withdraws anserine None under-arm?'),
 (4, 'Question 4', 'Over ephedra diselenide unwrinkled floor-light None?'),
 (5, 'Question 5', 'Over protobiont conduit gobemouche None mordacity?'),
 (6, 'Question 6', 'How nephew None selects skater None?'),
 (7, 'Question 7', 'Over broker Frankenstein premedications spectrological None?'),
 (8, 'Question 8', 'Calculate dissipated corndodger redissolving chested None?'),
 (9, 'Question 9', 'Calculate load-shedding leas met duplicitous comedienne?'),
 (10, 'Question 10', 'How Gasconading None crows cubation towing-net?'),
 (11, 'Question 11', 'Where zeppelins G-proteins KIBS None flushes?'),
 (12, 'Question 12', 'Where honeylocust vesicovaginal supereminent None subsequentness?'),
 (13, 'Question 13', 'Over GMC zillion barrowist dibbled None?'),
 (14, 'Question 14', 'Which amyloid mumming pi-dog perverteth None?'),
 (15, 'Question 15', 'How appliers oustering gametocyte Bakst None?')]

In [6]:
  
%%sql
SELECT *
  FROM Answers

 * sqlite:///gradedb.db
Done.

[(1, 'Given risible bloops pirouette encroach fellowship copy-cat diagrammatic None.', 5, 1),
 (2, 'Given haunters plying esp. bearer beholdest apposit warper None.', 5, 1),
 (3, 'Given Raquelle cGMP NASTRAN outwing royalists pre-stressed yodellers None.', 2, 3),
 (4, 'To calculate tone None corncockle waistcoating detail resectoscope useless habituates.', 5, 1),
 (5, 'Because meseraic assign beckoning woodlot None wracks conclusum storm-belt.', 1, 5),
 (6, 'Given Denmark malintent consistency dhurries felt-tipped Blanche unclosed None.', 14, 3),
 (7, 'To calculate seiche demythologized promptly faddle thick-knees refar pneumatological None.', 1, 1),
 (8, 'Given demagnetising cam-box Leamington administrating exsiccator ROI duckbills None.', 7, 2),
 (9, 'Resulting in lambdoid sonars ecclesiastically multitasker basson behabitive sealions None.', 15, 5),
 (10, 'Given residually hyperventilate firedrake tokenizing chickenburger unhoused detorting None.', 13, 2),
 (11, 'Resulting in unsullied que untextured assertative Karditsa feather-beds Brunei None.', 5, 1),
 (12, 'Resulting in janiceps ademption unilluminated daymark Aquino skylike gelechiid thible.', 2, 1),
 (13, 'Resulting in nonperformance Wolff kingfishers flourished unhasp carvers None plosively.', 7, 4),
 (14, 'Because demagoguism marbles Clarine cp. vituperator sizel None scriptures.', 5, 1),
 (15, 'Concluding great-aunt Mosby resoled saprolitic amounting prod gynandromorphs None.', 7, 4)]

In [7]:
  
%%sql
SELECT *
  FROM Task

 * sqlite:///gradedb.db
Done.

[(1, 'Task 688', 'This is task 688, there are multiple questions you need answer.'),
 (2, 'Task 405', 'This is task 405, there are multiple questions you need answer.'),
 (3, 'Task 871', 'This is task 871, there are multiple questions you need answer.'),
 (4, 'Task 980', 'This is task 980, there are multiple questions you need answer.'),
 (5, 'Task 913', 'This is task 913, there are multiple questions you need answer.')]

In [8]:
  
%%sql
SELECT *
  FROM Task_question

 * sqlite:///gradedb.db
Done.

[(1, 1, 1),
 (2, 1, 5),
 (3, 1, 2),
 (4, 2, 13),
 (5, 2, 7),
 (6, 2, 5),
 (7, 3, 2),
 (8, 3, 14),
 (9, 3, 1),
 (10, 4, 7),
 (11, 4, 9),
 (12, 4, 14),
 (13, 5, 6),
 (14, 5, 15),
 (15, 5, 1)]

In [9]:
%%sql
SELECT *
  FROM Submission

 * sqlite:///gradedb.db
Done.

[(1, 1), (2, 2), (3, 3), (4, 4), (5, 5)]

In [10]:
%%sql
SELECT *
  FROM Evaluation

 * sqlite:///gradedb.db
Done.

[(1, 1), (2, 2), (3, 3), (4, 4), (5, 5)]

In [11]:
%%sql
SELECT *
  FROM EvaluationRequest

 * sqlite:///gradedb.db
Done.

[(1, 1), (2, 4), (3, 2), (4, 5), (5, 3)]

In [12]:
  
%%sql
SELECT *
  FROM EvaluationFinished

 * sqlite:///gradedb.db
Done.

[(1, 1), (2, 2), (3, 3), (4, 4), (5, 5)]

In [13]:
%%sql
SELECT *
  FROM Scores

 * sqlite:///gradedb.db
Done.

[(1, 1, 1, 1), (2, 5, 13, 2), (3, 2, 8, 3), (4, 7, 5, 4), (5, 5, 3, 5)]

In [14]:
%%sql
SELECT 
    asg.universityid,
    asg.assignmentid,
    asg.taskid,
    tq.questionid,
    sb.submissionid,
    er.requestid,
    ev.evaluationid,
    ef.finishedid,
    sc.value
  FROM Assignment asg
  LEFT JOIN task_question tq ON tq.taskid = asg.taskid
  LEFT JOIN Submission sb ON sb.assignmentid = asg.assignmentid
  LEFT JOIN EvaluationRequest er ON er.submissionid = sb.submissionid
  LEFT JOIN Evaluation ev ON ev.requestid = er.requestid
  LEFT JOIN EvaluationFinished ef ON ef.evaluationid = ev.evaluationid
  LEFT JOIN Scores sc ON sc.evaluationid = ev.evaluationid

 * sqlite:///gradedb.db
Done.

[('S0416410', 1, 1, 1, 1, 1, 1, 1, 1),
 ('S0416410', 1, 1, 2, 1, 1, 1, 1, 1),
 ('S0416410', 1, 1, 5, 1, 1, 1, 1, 1),
 ('S0225853', 2, 2, 5, 2, 3, 3, 3, 2),
 ('S0225853', 2, 2, 7, 2, 3, 3, 3, 2),
 ('S0225853', 2, 2, 13, 2, 3, 3, 3, 2),
 ('S1961057', 3, 3, 1, 3, 5, 5, 5, 5),
 ('S1961057', 3, 3, 2, 3, 5, 5, 5, 5),
 ('S1961057', 3, 3, 14, 3, 5, 5, 5, 5),
 ('S2204697', 4, 4, 7, 4, 2, 2, 2, 5),
 ('S2204697', 4, 4, 9, 4, 2, 2, 2, 5),
 ('S2204697', 4, 4, 14, 4, 2, 2, 2, 5),
 ('S4587398', 5, 5, 1, 5, 4, 4, 4, 7),
 ('S4587398', 5, 5, 6, 5, 4, 4, 4, 7),
 ('S4587398', 5, 5, 15, 5, 4, 4, 4, 7)]